/*
1. Створити сутність "Людина".
    Властивості:
        імʼя;
        вік.
    Методи:
        конструктор, який приймає два параметри: імʼя та вік;
        метод, який виводить у консоль інформацію про людину.
2. Створити сутність "Автомобіль".
    Властивості:
        марка, модель, рік виписку, номерний знак (або на Ваш розсуд);
        власник.
    Методи:
        конструктор, який приймає чотитри параметри (тобто, всі окрім власника): марка, модель, рік виписку, номерний знак 
        присвоїти власника - метод повинен приймати екземпляр класу Людина, та зберігати екземпляр класу Людина 
            у відповідному полі, якщо вік більше 18, інакше виводити у консоль відповідне повідомлення
        метод, який виводить у консоль інформацію про автомобіль та викликає метод виводу інформації класу Людина 
            для виведення інформації про власника
В якості демонстраціїї створити:
декілька екземплярів класу Людина;
декілька екземплярів класу Автомобіль;
присвоїти власників автомобілям.
*/
// Імпортуємо класи
import { Person, Auto } from "./classes.js";

// Створюємо декілька екземплярів класу Person
const person1 = new Person("John", 25);
const person2 = new Person("Alice", 30);
const person3 = new Person("Bob", 17); // Тестуємо випадок, коли особа неповнолітня

// Створюємо декілька екземплярів класу Auto
const car1 = new Auto("Toyota", "Camry", 2020, "ABC123");
const car2 = new Auto("Honda", "Accord", 2018, "XYZ789");
const car3 = new Auto("Ford", "Focus", 2015, "DEF456");

// Присвоюємо власників автомобілям

car1.assignOwner(person1);
car2.assignOwner(person2);
car3.assignOwner(person3); // Спроба присвоєння власника неповнолітній особі

// Виводимо інформацію про автомобілі
console.log("Car 1:");
car1.outAutoInfo();
console.log("Car 2:");
car2.outAutoInfo();
console.log("Car 3:");
car3.outAutoInfo();
